NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM22/BGM220SC12WGA.svd
        <register>
          <name>LONGRANGE2</name>
          <description>No Description</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRTH1</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH2</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH3</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH4</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE3</name>
          <description>No Description</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRTH5</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH6</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH7</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH8</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE4</name>
          <description>No Description</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRTH9</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH10</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH1</name>
              <description>Long Range channel power shift</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH2</name>
              <description>Long Range channel power shift</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH3</name>
              <description>Long Range channel power shift</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH4</name>
              <description>Long Range channel power shift</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE5</name>
          <description>No Description</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRSH5</name>
              <description>Long Range channel power shift</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH6</name>
              <description>Long Range channel power shift</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH7</name>
              <description>Long Range channel power shift</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH8</name>
              <description>Long Range channel power shift</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH9</name>
              <description>Long Range channel power shift</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH10</name>
              <description>Long Range channel power shift</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH11</name>
              <description>Long Range channel power shift</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LONGRANGE6</name>
          <description>No Description</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF7FFFF</resetMask>
          <fields>
            <field>
              <name>LRCHPWRSPIKETH</name>
              <description>Long Range channel power spike threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRSPIKETHD</name>
              <description>Long Range spike threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRTH11</name>
              <description>Long Range channel power threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCHPWRSH12</name>
              <description>Long Range channel power shift</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LRFRC</name>
          <description>No Description</description>
          <addressOffset>0x154</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000101</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>CI500</name>
              <description>Long Range CI mapping for 500kbps</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCACKTIMETHD</name>
              <description>FRC acknowledge timeout threshold</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LRCORRMODE</name>
              <description>LR Correlator operation Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSATHD3</name>
          <description>No Description</description>
          <addressOffset>0x168</addressOffset>
          <access>read-write</access>
          <resetValue>0x07830464</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPIKETHDLO</name>
              <description>Spike threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNMODTHDLO</name>
              <description>Unmodulated carrier detector threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDEVMINTHDLO</name>
              <description>Frequency deviation minimum threshold</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FDEVMAXTHDLO</name>
              <description>Frequency deviation maximum threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSATHD4</name>
          <description>No Description</description>
          <addressOffset>0x16C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00821388</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>POWABSTHDLO</name>
              <description>Power absolute threshold for low power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRTOLERTHD0LO</name>
              <description>Arrival tolerance threshold 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARRTOLERTHD1LO</name>
              <description>Arrival tolerance threshold 1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWTHD</name>
              <description>Enable switch threshold for low power</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VTBLETIMING</name>
          <description>No Description</description>
          <addressOffset>0x170</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFF3</resetMask>
          <fields>
            <field>
              <name>VTBLETIMINGSEL</name>
              <description>Viterbi BLE timing stamp selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAMEDET_DELAY</name>
                  <description>Delayed frame detection will be used as Timing stamp. This mode should be selected for legacy demod and Long Range BLE demod. </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END_FRAME_PULSE</name>
                  <description>The end of frame detection from Narrow Viterbi demod will be used as Timing stamp. This signal is a narrow pulse signal and pulse width is one xo clock cycle. </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END_FRAME</name>
                  <description>The end of frame detection from Narrow Viterbi demod will be used as Timing stamp. This signal is a wdie pulse signal </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_END_FRAME</name>
                  <description>For testing only.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMINGDELAY</name>
              <description>Viterbi BLE Delay timer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLENOFF</name>
              <description>Timing Stamp Frame Length Offset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>
          <fields>
            <field>
              <name>TXFRAMESENT</name>
              <description>Frame sent</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSYNCSENT</name>
              <description>Sync word sent</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPRESENT</name>
              <description>Preamble sent</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRAMPDONE</name>
              <description>Mod ramper idle</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDTNOARR</name>
              <description>No signal Detected in LDT </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHDSADET</name>
              <description>PHASE DSA DETECT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYUNCODEDET</name>
              <description>CONCURRENT UNCODED PHY DET</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYCODEDET</name>
              <description>CONCURRENT CODED PHY DET</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMDET</name>
              <description>Timing detected</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPREDET</name>
              <description>Preamble detected</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFRAMEDET0</name>
              <description>Frame with sync-word 0 detected</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFRAMEDET1</name>
              <description>Frame with sync-word 1 detected</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMLOST</name>
              <description>Timing lost</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPRELOST</name>
              <description>Preamble lost</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFRAMEDETOF</name>
              <description>Frame detection overflow</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXTIMNF</name>
              <description>Timing not found</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRCTIMOUT</name>
              <description>DEMOD-FRC req/ack timeout</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETS</name>
              <description>Early Time Stamp detect</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFGANTPATTRD</name>
              <description>cfg</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
